export default {
    pageSizeOptions: ["40", "80", "120"],
    pageSize: 40
};

export const trackStatusMap = {
  '-1': '请选择',
  '1': '未结案',
  '2': '3天内无法联系',
  '3': '已入职',
  '4': '放弃',
  '5': '急需找工作',
  '6': '已有工作',
  '7': '学生',
  '8': '年后来面试'
};

export const callTypeMap = {
  '1': '普通聊天',
  '2': '报名',
  '3': '关注',
  '4': '注册',
  '5': '门店反馈',
  '6': '400反馈',
  '7': '提问',
  '8': '明日签到',
  '9': '一键来接',
  '10': '考勤打卡',
  '11': '面试回访',
  '12': '入职一周回访'
};


export const EventTypeMap = {
  1: '工资待遇',
  2: '补贴咨询',
  3: '推荐费',
  4: '报名咨询',
  5: '劳务协助',
  6: '离职事宜',
  7: '系统问题',
  8: '其它',
  9: '面试状态',
  10: '录用条件',
  11: '体检/住宿',
  12: '周薪薪',
  13: '需求问题'
};

export const EventDealStatusMap = {
  1: '未处理',
  2: '处理中',
  4: '已结案',
  5: '已裁决'
};

export const PayTypeMap = {
  0: '按月',
  1: '按周'
};

export const ZxxTypeMap = {
  1: '1.0',
  2: '2.0'
};
