export default {
    "postCode": /^[1-9][0-9]{5}$/, // 邮政编码
    "idCard": /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/, // 身份证号码验证表达式
    // "chCode": /^[\u4e00-\u9fa5\s+]/ig, // 所有字符必须为中文字符
    "chCode": /^[\u4e00-\u9fa5a-zA-Z]+$/, // 所有字符必须为中文字符,数字和英文
    "enCode": /^[a-zA-Z\s]+$/, // 所有的英文字符
    "mobile": /^1[3-9][0-9]\d{8}$/, // 验证手机号码/^1[3|4|5|8][0-9]\d{4,8}$/
    "empty": /^\s+|\s+$/ig, // 移除字符串空字符串
    "illegal": /[@#\$%\^&\*]+/g, // 检验非法字符
    "number": /[^0-9]+/, // 必须为数字
    "email": /^\S+\@\S+\.\S+$/
};