/**
 * 注册会员相关映射表
 */
export default {
    // 性别
    eGender: {
        0: '未知',
        1: '男',
        2: '女'
    },
    // 注册来源
    eRegSource: {
        0: '网站',
        1: 'APP',
        2: '地推',
        3: 'wifi',
        4: '代注册',
        5: '门店',
        // 6: '无线网',
        7: 'APP推荐',
        8: '代推荐',
        9: '门店推荐',
        10: '现场刷机'
    },
    // 会员认证状态
    eCertStatus: {
        0: '未认证',
        1: '已认证'
    },
    // 认证方式
    eCertType: {
        0: '未认证',
        1: '现场认证',
        2: '手持认证',
        3: '辅助认证'
    },
    // 锁定状态
    eLockStatus: {
        0: '未锁定',
        1: '已锁定'
    },
    // 是否禁言
    eShutup: {
        0: '未禁言',
        1: '已禁言'
    },
    // 推荐状态
    eInviteStatus: {
        0: '未注册',
        1: '已注册',
        2: '已入职',
        3: '作废'
    },
    // 经纪人视角的会员状态
    eBrokerStatus: {
        1: '从未体验',
        2: '预报名',
        3: '派车',
        4: '签到',
        5: '面试',
        6: '入职'
    },
    // 会员推荐来源
    eRecommendSource: {
        0: 'App',
        1: '代推荐'
    },
    // todo根据 eBrokerStatus 的 CurrentStatus
    eBrokerStatus_CurrentStatus: {
        2: {
            0: '',
            1: '未结案',
            2: '已结案'
        },
        4: {
            0: '',
            1: '已签到',
            2: '已去面试',
            3: '未面试'
        },
        5: {
            0: '',
            1: '等待面试名单',
            2: '面试通过',
            3: '面试不通过',
            4: '面试放弃'
        },
        3: {
            0: '',
            1: '等待处理',
            2: '已处理',
            3: '已接到',
            4: '未接到',
            5: '已送达'
        },
        6: {
            0: '',
            1: '等待在离职名单',
            2: '在职',
            3: '离职',
            4: '放弃'
        }
    },
    eBrokerStatus_DispatchContent: {
        0: '',
        1: '未联系',
        2: '已联系',
        3: '联系不上',
        4: '停关机',
        5: '空号',
        6: '放弃'
    }
};