// 审核相关枚举值
export default {
    // 身份证来源
    eCertSource: {
        1: '我打',
        2: '记返费',
        3: '周薪薪'
    },
    // 身份证图片类型
    eCardPicType: {
        1: 'OCR',
        2: '非OCR',
        3: '高拍仪'
    },
    // 审核状态
    // 1待审核 3审核通过 4审核未通过
    eAuditStatus: {
        1: '待审核',
        3: '审核通过',
        4: '审核未通过'
    },
    // 1.非身份证，2.不清晰
    eIDCardReason: {
        1: '非身份证',
        2: '不清晰'
    },
    // 1.非银行卡，2.不清晰，3.不是储蓄卡，4.不支持该银行
    eBankCardReason: {
        1: "非银行卡",
        2: "不清晰",
        3: "不是储蓄卡",
        4: "不支持该银行"
    },
    // 1.不清晰，2.不是工牌照片，3.不是本人工牌，4.不是该企业工牌
    eWorkCardReason: {
        1: "不清晰",
        2: "不是工牌照片",
        3: "不是本人工牌",
        4: "不是该企业工牌"
    },
    // 1.不清晰，2.不是考勤照片，3.不是本人考勤，4.不是该企业考勤
    eAttendanceReason: {
        1: "不清晰",
        2: "不是考勤照片",
        3: "不是本人考勤",
        4: "不是该企业考勤"
    }
};