/**
 * 派单追踪相关映射，未联调后台
 */
export default {
    // 是否报名
    eSignStatus: {
        1: '未报名',
        2: '已报名',
        3: '取消'
    },
    // 接送类型(筛选用)
    eBoardingType: {
        1: '我打司机',
        2: '企业滴滴',
        3: '出租车'
    },
    // 接送类型(包含接送状态映射)
    eBoardingTypeComplex: {
        1: {
            value: '我打司机', eBoardingStatus: {
                1: '等待接单',
                2: '已处理',
                3: '已接到',
                4: '未接到',
                5: '已送达'
            }
        },
        2: {
            value: '企业滴滴', eBoardingStatus: {
                2: '已处理',
                3: '已接到',
                4: '未接到',
                5: '已送达'
            }
        },
        3: {
            value: '出租车', eBoardingStatus: {
                2: '已处理',
                5: '已送达'
            }
        }
    },
    // 接送类型(表格用)
    eBoardingTypeAll: {
        0: '待定',
        1: '我打司机',
        2: '企业滴滴',
        3: '出租车'
    },
    eBoardingTypeOther: {
        0: '待定',
        2: '企业滴滴',
        3: '出租车'
    },
    // 接送状态：1、等待接单 2、已处理 3、已接到 4、未接到 5、已送达
    eBoardingStatus: {
        1: '等待接单',
        2: '已处理',
        3: '已接到',
        4: '未接到',
        5: '已送达'
    },
    // 我打司机接单状态：0，派单中 1、司机已接单（派单成功） 2、全部拒绝（派单失败）
    eDriverAcceptStatus: {
        0: '我打派单中',
        1: '我打派单成功',
        2: '我打派单失败'
    },
    // 1、未联系 2、已联系 3、联系不上 4、停关机 5、空号 6，放弃
    eContactType: {
        1: '未联系',
        2: '已联系',
        3: '联系不上',
        4: '停关机',
        5: '空号',
        6: '放弃'
    }
};


