/**
 * 面试名单相关映射
 */
export default {
    // 倒计时
    // 1、进行中 2、已结束 3、未进行
    eCountdownStatus: {
        1: '进行中',
        2: '已结束',
        3: '未进行'
    },
    // 业务处理
    // 1未面试 2通过 3未通过 4放弃
    eJFFInterviewStatus: {
        0: '未处理',
        1: '未面试',
        2: '面试通过',
        3: '面试未通过',
        4: '放弃面试'
    },
    // 客服回访
    eInterviewStatus: {
        0: '未处理',
        1: '待定或面试失联',
        2: '正常入职',
        3: '未通过',
        4: '放弃'
    },
    // 经纪人处理
    // 2、通过 3、未通过4、放弃
    eBrokerInterviewStatus: {
        1: '待确认',
        2: '通过',
        3: '未通过',
        4: '放弃'
    },
    // 工牌
    // 1、审核中 2、审核通过 3、审核失败 4、未上传
    eWorkCardStatus: {
        1: '审核中',
        2: '审核通过',
        3: '审核失败',
        4: '未上传'
    },
    // 是否为周薪薪
    ePayType: {
        0: '非周薪薪',
        1: '周薪薪'
    }
};
