/**
 * 账单
 */
export default {
    // 	账务类型
    /*
    劳务返费		[9]
        会员补贴		[8]
        收退费			[1,2]
        收退费（劳务）		[3]
    推荐费			[7]
    报销费			[6]
    赠品押金		[4,5]
    申诉订单		[11]*/
    eFeeTypeList: [
        {key: "9", value: "劳务返费"},
        {key: "8", value: "会员补贴"},
        {key: "1,2", value: "收退费"},
        {key: "3", value: "收退费(劳务)"},
        {key: "7", value: "推荐费"},
        {key: "6", value: "报销费"},
        {key: "4,5", value: "赠品押金"},
        {key: "11", value: "申诉订单"}
    ],


    TradeType: {
        9: '劳务返费',
        8: '会员补贴',
        1: '收退费（收）',
        2: '收退费（退）',
        3: '收退费（劳务）',
        7: '推荐费',
        6: '报销费',
        4: '赠品押金（收）',
        5: '赠品押金（退）',
        11: '申诉订单'
    },
    eInvoiceStatus: {
        1: '未开票',
        2: '已开票',
        3: '部分开票'
    }
};


