/**
 * 部门委托相关映射
 */
export default {
    // 委托状态
    // 1、未处理；2、已处理；3、有新追问
    eStatus: {
        1: '未处理',
        2: '已处理',
        3: '有新追问'
    },
    // eStatus: {
    //     1: '未读',
    //     2: '已读',
    //     3: '有新回复',
    //     4: '已回复'
    // },
    // 委托结果
    eCloseStatus: {
        1: '已结案',
        2: '未结案'
    },
    // 部门 已走后台，getDepartmentList()
    // eDepartment: {
    //     1: '业务部门',
    //     2: '财务部门'
    // },
    // 有无未读消息
    eIsNewMsgStatus: {
        1: '有',
        2: '无'
    },
    // 满意度级别
    eGradeLevel: {
        1: "非常满意",
        2: "满意",
        3: "不满意",
        4: "非常不满意"
    }
};


